init.org
* Table of contents                                                     :TOC:
- [[#setup-][Setup !]]
  - [[#basics-][Basics !]]
    - [[#preface][Preface]]
    - [[#package-manager][Package Manager]]
      - [[#elpaca-installation][Elpaca Installation]]
      - [[#elpaca-use-package-integration][Elpaca use-package Integration]]
      - [[#melpulls][Melpulls]]
      - [[#elpaca-build-if-new][Elpaca build if new]]
      - [[#elpaca-customisation][Elpaca Customisation]]
        - [[#config][Config]]
    - [[#init-benchmark-][init benchmark !]]
    - [[#magit-][Magit !]]
      - [[#with-editor][With-Editor]]
      - [[#transient-][Transient !]]
        - [[#config-][Config !]]
        - [[#faces-][Faces !]]
      - [[#magit--1][Magit !]]
      - [[#magit-commit-mark-][Magit commit mark !]]
      - [[#magit-others-][Magit others !]]
    - [[#eshell-][Eshell !]]
      - [[#general-][General !]]
          - [[#em-dirsel-][em-dirs.el !]]
          - [[#em-basicel-][em-basic.el !]]
      - [[#config--1][Config !]]
      - [[#eloginel-][elogin.el !]]
      - [[#eprofileel-][eprofile.el !]]
    - [[#yasnippets-][Yasnippets !]]
    - [[#eldoc-][Eldoc !]]
    - [[#lsp-bridge-][LSP-bridge !]]
    - [[#yafolding-][yafolding !]]
    - [[#iedit][Iedit]]
    - [[#idk-][IDK !]]
    - [[#arxiv-][ARXIV !]]
    - [[#treesit-][treesit !]]
    - [[#novice][Novice]]
    - [[#dired][Dired]]
      - [[#dired-auto-readme][dired-auto-readme]]
    - [[#copy-on-wayland-][Copy on wayland !]]
  - [[#visuals-][Visuals !]]
    - [[#page-break-lines][Page Break Lines]]
    - [[#trailing-spaces-][Trailing spaces !]]
    - [[#dashboard-][Dashboard !]]
    - [[#colors][Colors]]
      - [[#colorful-mode][Colorful-mode]]
    - [[#ascii-table-][Ascii table !]]
      - [[#config-1][Config]]
      - [[#faces--1][Faces !]]
    - [[#themes-][Themes !]]
      - [[#pink-bliss-uwu-][Pink Bliss UwU !]]
      - [[#shades-of-purple][Shades Of Purple]]
      - [[#girly-notebook][Girly Notebook]]
    - [[#screenshots-][Screenshots !]]
      - [[#svg][SVG]]
      - [[#screenshotel-][screenshot.el !]]
    - [[#consult--vertico--embark][Consult + Vertico + embark]]
  - [[#programming-languages-][Programming Languages !]]
    - [[#c-][C !]]
      - [[#clangd-][Clangd !]]
      - [[#test-c][Test-c]]
        - [[#notes][Notes]]
        - [[#config-2][Config]]
      - [[#gobolt-][Gobolt !]]
      - [[#cc-mode-][CC-mode !]]
        - [[#notes-1][Notes]]
    - [[#latex-][LATEX !]]
      - [[#auctex-][Auctex !]]
      - [[#latexmk-][LatexMK !]]
      - [[#cdlatex-][CDlatex !]]
      - [[#xenops-][Xenops !]]
      - [[#laas-][Laas !]]
      - [[#amsreftex-][amsreftex !]]
      - [[#magic-latex-buffer-][Magic-latex-buffer !]]
      - [[#latex-preview-pane-][Latex-preview-pane !]]
      - [[#litex-][Litex !]]
      - [[#tex-item-][tex-item !]]
      - [[#tex-parens-][tex-parens !]]
      - [[#latex-table-wizard-][latex-table-wizard !]]
      - [[#preview-latex-][preview-latex !]]
      - [[#texlab-lsp-][Texlab (LSP) !]]
    - [[#ocaml-][OCAML !]]
      - [[#opam][Opam]]
      - [[#opam-switch][Opam-Switch]]
      - [[#caml-][Caml !]]
      - [[#tuareg-][Tuareg !]]
      - [[#merlin-][Merlin !]]
      - [[#merlin-eldoc][Merlin-Eldoc]]
      - [[#dune][Dune]]
      - [[#merlin-iedit][Merlin-Iedit]]
      - [[#ocamlformat-][Ocamlformat !]]
      - [[#utop-][Utop !]]
        - [[#faces-utop-][Faces utop :]]
    - [[#coq-][Coq !]]
      - [[#proof-general-][Proof General !]]
    - [[#lolcode][Lolcode]]
    - [[#yaml-][Yaml !]]
      - [[#yaml-mode-][Yaml-mode !]]
      - [[#yaml-pro-][Yaml-pro !]]
    - [[#other-handlers-][other handlers !]]
    - [[#java-][Java !]]
      - [[#java-mode-][Java-mode !]]
      - [[#gradle][Gradle]]
        - [[#gradle-installation][Gradle Installation]]
        - [[#gradle-mode][Gradle-mode]]
      - [[#jdtls][JDTLS]]
      - [[#javadoc-lookup-][Javadoc-lookup !]]
    - [[#ebuilds-][Ebuilds !]]
  - [[#org-][Org !]]
    - [[#org][org]]
    - [[#toc-org][toc-org]]
    - [[#org-modern-][org-modern !]]
      - [[#config-3][Config]]
      - [[#customization][Customization]]
    - [[#org-popup-posframe-][org-popup-posframe !]]

* Setup !
:PROPERTIES:
:COLUMNS: %ITEM %EMACS %REQ_EXT %REQ_INT %OPT_EXT %OPT_INT %LASTCHECKED
:END:
** Basics !
*** Preface
:PROPERTIES:
:EMACS: 24.1
:REQ_EXT: None
:REQ_INT: None
:OPT_EXT: None
:OPT_INT: None
:LASTCHECKED: None
:END:
We have to turn off `Package.el` because it'll autoload all packages, which goes against elpaca's methodology.
#+begin_src elisp :tangle "yes"
  ;; -*- lexical-binding: t; -*-
  (setq package-enable-at-startup nil)
#+end_src
*** Package Manager
**** Elpaca Installation
:PROPERTIES:
:EMACS: 27.1
:REQ_EXT: git
:REQ_INT: None
:OPT_EXT: None
:OPT_INT: ba0d884338f2aef107602951671a67742b83c829
:END:
#+begin_src elisp :tangle "yes"
  (defvar elpaca-installer-version 0.11)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1 :inherit ignore
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
#+end_src
**** Elpaca use-package Integration
#+begin_src elisp :tangle "yes"
  (elpaca elpaca-use-package
    (elpaca-use-package-mode))
#+end_src
**** Melpulls
#+begin_src elisp :tangle "yes"
  (elpaca-queue (elpaca '(melpulls :host github :repo "progfolio/melpulls")
                  (add-to-list 'elpaca-menu-functions #'melpulls)))
#+end_src
**** Elpaca build if new
#+begin_src elisp :tangle "yes"
  (defun +elpaca/build-if-new (e)
    (setf (elpaca<-build-steps e)
          (if-let* ((default-directory (elpaca<-build-dir e))
                    (main (ignore-errors (elpaca--main-file e)))
                    (compiled (expand-file-name (concat (file-name-base main) ".elc")))
                    ((file-newer-than-file-p main compiled)))
              (progn (elpaca--signal e "Rebuilding due to source changes")
                     (cl-set-difference elpaca-build-steps
                                        '(elpaca--clone elpaca--configure-remotes elpaca--checkout-ref)))
            (elpaca--build-steps nil (file-exists-p (elpaca<-build-dir e))
                                 (file-exists-p (elpaca<-repo-dir e)))))
    (elpaca--continue-build e))
#+end_src
**** Elpaca Customisation
***** Config
None, elpaca has very sane defaults.
*** init benchmark !
:PROPERTIES:
:EMACS: 24.3
:REQ_EXT: None
:REQ_INT: None
:OPT_EXT: None
:OPT_INT: None
:LASTCHECKED: None
:END:
#+begin_src elisp :tangle "yes"
  (use-package benchmark-init
    :ensure t
    :config
    ;; To disable collection of benchmark data after init is done.
    (add-hook 'after-init-hook 'benchmark-init/deactivate))
#+end_src
*** Magit !
**** With-Editor
:PROPERTIES:
:EMACS: 26.1
:REQ_EXT: None
:REQ_INT: ("Compat" "30.1") which requires ("seq" "2.23") but this is covered by the emacs version.
:OPT_EXT: None
:OPT_INT: None
:LASTCHECKED: 87a384a0e59260cca41ca8831d98e195b1ec8ada
:END:
#+begin_src elisp :tangle "yes"
  (use-package with-editor
    :ensure (with-editor :host github :repo "magit/with-editor")
    :hook (eshell-mode . with-editor-export-editor) ;; should this be defined in eshell instead?
    :config
    (shell-command-with-editor-mode)
    :custom
    (with-editor-mode-lighter " w.ed"))
#+end_src
**** Transient !
:PROPERTIES:
:EMACS: 28.1
:REQ_EXT: None
:REQ_INT: ("Compat" "30.1"), ("seq" "2.24"), ("cond-let" "0.1")
:OPT_EXT: None
:OPT_INT: None
:END:
***** Config !
#+begin_src elisp :tangle "yes"
  (use-package transient
    :ensure (transient :host github :repo "magit/transient")
    :custom
    (transient-highlight-mismatched-keys t) ;; this is for customizing the faces, unless I grow to like it
    (transient-highlight-higher-levels t) ;; same as above
    (transient-default-level 7) ;; same as above
    )
#+end_src
