init.el
;; -*- lexical-binding: t; -*-
(setq package-enable-at-startup nil)

(defvar elpaca-installer-version 0.11)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1 :inherit ignore
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (<= emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                  ,@(when-let* ((depth (plist-get order :depth)))
                                                      (list (format "--depth=%d" depth) "--no-single-branch"))
                                                  ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                                        (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                        "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

(elpaca elpaca-use-package
  (elpaca-use-package-mode))

(elpaca-queue (elpaca '(melpulls :host github :repo "progfolio/melpulls")
                (add-to-list 'elpaca-menu-functions #'melpulls)))

(defun +elpaca/build-if-new (e)
  (setf (elpaca<-build-steps e)
        (if-let* ((default-directory (elpaca<-build-dir e))
                  (main (ignore-errors (elpaca--main-file e)))
                  (compiled (expand-file-name (concat (file-name-base main) ".elc")))
                  ((file-newer-than-file-p main compiled)))
            (progn (elpaca--signal e "Rebuilding due to source changes")
                   (cl-set-difference elpaca-build-steps
                                      '(elpaca--clone elpaca--configure-remotes elpaca--checkout-ref)))
          (elpaca--build-steps nil (file-exists-p (elpaca<-build-dir e))
                               (file-exists-p (elpaca<-repo-dir e)))))
  (elpaca--continue-build e))

(use-package benchmark-init
  :ensure t
  ;; To disable collection of benchmark data after init is done
  :config
  (add-hook 'after-init-hook #'benchmark-init/deactivate))

(use-package with-editor
  :ensure (with-editor :host github :repo "magit/with-editor")
  :hook (eshell-mode . with-editor-export-editor)
  :config
  (shell-command-with-editor-mode)
  :custom
  (with-editor-mode-lighter " w.ed"))

(use-package transient
  :ensure (transient :host github :repo "magit/transient")
  :custom
  (transient-highlight-mismatched-keys t) ;; this is for customizing the faces, unless I grow to like it
  (transient-highlight-higher-levels t) ;; same as above
  (transient-default-level 7) ;; same as above
  )

(use-package magit
