init.org
***** Faces !
Need to customize these faces.
#+begin_src elisp :tangle "no"
  (defface transient-heading '((t :inherit font-lock-keyword-face))
    "Face used for headings."
    :group 'transient-faces)

  (defface transient-argument '((t :inherit font-lock-string-face :weight bold))
    "Face used for enabled arguments."
    :group 'transient-faces)

  (defface transient-inactive-argument '((t :inherit shadow))
    "Face used for inactive arguments."
    :group 'transient-faces)

  (defface transient-inapt-argument '((t :inherit shadow :weight bold))
    "Face used for inapt arguments with a (currently ignored) value.
  Depending on the type this is used for the argument and/or value."
    :group 'transient-faces)

  (defface transient-value '((t :inherit font-lock-string-face :weight bold))
    "Face used for values."
    :group 'transient-faces)

  (defface transient-inactive-value '((t :inherit shadow))
    "Face used for inactive values."
    :group 'transient-faces)

  (defface transient-unreachable '((t :inherit shadow))
    "Face used for suffixes unreachable from the current prefix sequence."
    :group 'transient-faces)

  (defface transient-inapt-suffix '((t :inherit shadow :slant italic))
    "Face used for suffixes that are inapt at this time."
    :group 'transient-faces)

  (defface transient-active-infix '((t :inherit highlight))
    "Face used for the infix for which the value is being read."
    :group 'transient-faces)

  (defface transient-enabled-suffix
    '((t :background "green" :foreground "black" :weight bold))
    "Face used for enabled levels while editing suffix levels.
  See info node `(transient)Enabling and Disabling Suffixes'."
    :group 'transient-faces)

  (defface transient-disabled-suffix
    '((t :background "red" :foreground "black" :weight bold))
    "Face used for disabled levels while editing suffix levels.
  See info node `(transient)Enabling and Disabling Suffixes'."
    :group 'transient-faces)

  (defface transient-higher-level
    (let* ((color (face-attribute 'shadow :foreground t t))
           (color (if (eq color 'unspecified) "grey60" color)))
      `((t :box (:line-width (-1 . -1) :color ,color))))
    "Face optionally used to highlight suffixes on higher levels.
  See also option `transient-highlight-higher-levels'."
    :group 'transient-faces)

  (defface transient-delimiter '((t :inherit shadow))
    "Face used for delimiters and separators.
  This includes the parentheses around values and the pipe
  character used to separate possible values from each other."
    :group 'transient-faces)

  (defface transient-key '((t :inherit font-lock-builtin-face))
    "Face used for keys."
    :group 'transient-faces)

  (defface transient-key-stay
    `((((class color) (background light))
       :inherit transient-key
       :foreground "#22aa22")
      (((class color) (background dark))
       :inherit transient-key
       :foreground "#ddffdd"))
    "Face used for keys of suffixes that don't exit the menu."
    :group 'transient-faces)

  (defface transient-key-noop
    `((((class color) (background light))
       :inherit transient-key
       :foreground "grey80")
      (((class color) (background dark))
       :inherit transient-key
       :foreground "grey30"))
    "Face used for keys of suffixes that currently cannot be invoked."
    :group 'transient-faces)

  (defface transient-key-return
    `((((class color) (background light))
       :inherit transient-key
       :foreground "#aaaa11")
      (((class color) (background dark))
       :inherit transient-key
       :foreground "#ffffcc"))
    "Face used for keys of suffixes that return to the parent menu."
    :group 'transient-faces)

  (defface transient-key-recurse
    `((((class color) (background light))
       :inherit transient-key
       :foreground "#2266ff")
      (((class color) (background dark))
       :inherit transient-key
       :foreground "#2299ff"))
    "Face used for keys of sub-menus whose suffixes return to the parent menu."
    :group 'transient-faces)

  (defface transient-key-stack
    `((((class color) (background light))
       :inherit transient-key
       :foreground "#dd4488")
      (((class color) (background dark))
       :inherit transient-key
       :foreground "#ff6699"))
    "Face used for keys of sub-menus that exit the parent menu."
    :group 'transient-faces)

  (defface transient-key-exit
    `((((class color) (background light))
       :inherit transient-key
       :foreground "#aa2222")
      (((class color) (background dark))
       :inherit transient-key
       :foreground "#ffdddd"))
    "Face used for keys of suffixes that exit the menu."
    :group 'transient-faces)

  (defface transient-unreachable-key
    '((t :inherit (shadow transient-key) :weight normal))
    "Face used for keys unreachable from the current prefix sequence."
    :group 'transient-faces)

  (defface transient-nonstandard-key
    `((t :box (:line-width (-1 . -1) :color "cyan")))
    "Face optionally used to highlight keys conflicting with short-argument.
  See also option `transient-highlight-mismatched-keys'."
    :group 'transient-faces)

  (defface transient-mismatched-key
    `((t :box (:line-width (-1 . -1) :color "magenta")))
    "Face optionally used to highlight keys without a short-argument.
  See also option `transient-highlight-mismatched-keys'."
    :group 'transient-faces)
#+end_src
**** Magit !
#+begin_src elisp :tangle "yes"
  (use-package magit
    :ensure (magit :host github :repo "magit/magit"))
#+end_src
#+begin_src elisp :tangle "yes"
  (use-package sqlite3
    :ensure (sqlite3 :host github :repo "pekingduck/emacs-sqlite3-api"))

  (use-package yaml
    :ensure (yaml :host github :repo "zkry/yaml.el" ))
  (use-package cond-let
    :ensure (cond-let :host github :repo "tarsius/cond-let"))

  (use-package forge
    ;;:ensure nil
    :ensure (forge :host github :repo "magit/forge")
    )
#+end_src

**** Magit commit mark !
A CONFIG
#+begin_src elisp :tangle "yes"
  (use-package magit-commit-mark
    :ensure (magit-commit-mark :host codeberg :repo "ideasman42/emacs-magit-commit-mark"))
#+end_src
**** Magit others !
TODO :
#+begin_src elisp :tangle "no"
  https://github.com/magit/git-modes/tree/main
  https://github.com/alphapapa/magit-todos/tree/master
  https://github.com/magit/orgit-forge/tree/main
  https://github.com/bradwright/magit-find-file.el/tree/master
  https://github.com/magit/magit-annex/tree/master
  https://github.com/magit/magit-popup/tree/master
  https://github.com/magit/orgit/tree/main
  https://github.com/sigma/magit-gh-pulls/tree/master
#+end_src
*** Eshell !
TODO : CUSTOMIZE FACES.
**** General !
When Eshell first starts, it reads and excute the files `eshell-login-script` and `eshell-rc-script`.
To call an external process that has a lisp counterpart, prepend `eshell-explicit-command-char` to the command.

An Eshell module is defined the same as any other library but with two additional requirements:
- first, the module’s source file should be named em-name.el;
-  econd, the module must define an autoloaded Customize group with eshell-module as the parent group.
****** em-dirs.el !
- eshell-directory-change-hook : Idea, there exist `eshell-list-files-after-cd`, but it's annoying with ~/, as such, maybe create an util to ls -a when it's not in ~/?
****** em-basic.el !
- eshell-plain-echo-behavior nil [hot]
  
**** Config ! 
#+begin_src elisp :tangle "yes"
  (use-package eshell
    :ensure nil
    :demand t
    :custom
    ;; em-cmpl.el
    (eshell-show-lisp-completions nil) ; t would be too laggy and verbose
    ;; em-dirs.el
    (eshell-pushd-tohome t)
    (eshell-pushd-dextract t)
    (eshell-pushd-dunique t)
    ;; em-glob.el
    (eshell-glob-include-dot-files t)
    (eshell-glob-include-dot-dot t) ; idk
    ;; em-ls.el
    (eshell-ls-exclude-hidden nil) ; We already are using -A and -a, but we keep that in case, note that -A overrides this, so it won't show .. and .
    (eshell-ls-initial-args "-Ah")
    (eshell-ls-dired-initial-args "-ah")
    (eshell-ls-use-in-dired t)
    ;; em-script.el
    (eshell-login-script "~/.emacs.d/eshell/elogin.el")
    (eshell-login-script "~/.emacs.d/eshell/eprofile.el")
    ;; em-term.el
    (eshell-visual-subcommands (("git" "log" "diff" "show")))
    (eshell-visual-options (("git" "--help" "-h" "--paginate" "-p" )))
    ;; em-unix.el
    (eshell-rm-removes-directories t)
    ;; esh-cmd.el
    (eshell-prefer-lisp-functions t)
    ;; esh-mode.el
    (eshell-directory-name "~/.emacs.d/eshell/")
    ;; esh-module.el
    (eshell-modules-list '(eshell-alias
                           ;; eshell-banner ; done in elogin.el
                           eshell-basic
                           eshell-cmpl
                           eshell-dirs
                           ;; eshell-elecslash ; unpractical.
                           eshell-extpipe
                           eshell-glob
                           eshell-hist
                           eshell-ls
                           eshell-pred
                           eshell-prompt
                           ;; eshell-rebind ;; bad rebinds.
                           eshell-script
                           ;; eshell-smart ;; quirky and buggy.
                           eshell-term
                           ;; eshell-tramp ;; I don't use tramp.
                           ;; eshell-xtra ;; I don't use these aliases.
                           eshell-unix)))
#+end_src
**** elogin.el !
#+begin_src elisp :tangle eshell/elogin.el
  echo "Welcome, My Queen, to your, oh so marvelous, Emacs Shell instance.\nWhat are *Her Highness* directives on this fine day ?\n"
#+end_src
**** eprofile.el !
#+begin_src elisp :tangle eshell/eprofile.el
#+end_src
*** Yasnippets !
#+begin_src elisp :tangle "yes"
  (use-package yasnippet
    :ensure t
    :hook (c-mode . yas-minor-mode)
    :config
    (define-key yas-minor-mode-map [(tab)]        nil)
    (define-key yas-minor-mode-map (kbd "TAB")    nil)
    (define-key yas-minor-mode-map (kbd "<tab>")  nil)
    (yas-global-mode t))
#+end_src
*** Eldoc !
For older versions of emacs, if not running latest.
#+begin_src elisp :tangle "no"
  (use-package eldoc
    :ensure t
    :demand t
    :preface
    ;; avoid loading of built-in eldoc, see https://github.com/progfolio/elpaca/issues/236#issuecomment-1879838229
    (unload-feature 'eldoc t)
    (setq custom-delayed-init-variables '())
    (defvar global-eldoc-mode nil)
    :config
    (global-eldoc-mode))
#+end_src
When running latest (no need to upgrade eldoc)
#+begin_src elisp :tangle "yes"
  (use-package eldoc
    :ensure nil
    :demand t
    :config
    (global-eldoc-mode))
#+end_src
*** LSP-bridge !
Install Python dependencies: pip3 install epc orjson sexpdata six setuptools paramiko rapidfuzz watchdog packaging
for cargo : curl https://sh.rustup.rs -sSf | sh
yaml : npm install -g yaml-language-server
#+begin_src elisp :tangle "yes"
  (use-package lsp-bridge
    :ensure '(lsp-bridge
              :type git :host github :repo "manateelazycat/lsp-bridge"
              :files (:defaults "*.el" "*.py" "acm" "core" "langserver" "multiserver" "resources")
              :build (:not elpaca--byte-compile))
    :custom
    (lsp-bridge-c-lsp-server "clangd")
    (lsp-bridge-python-multi-lsp-server "pylsp_ruff")
    (lsp-bridge-python-lsp-server "pylsp")
    (lsp-bridge-tex-lsp-server "texlab")
    ;;(lsp-bridge-markdown-lsp-server )
    (lsp-bridge-cmake-lsp-server "cmake-language-server")
    ;;; Variables.
    (lsp-bridge-enable-inlay-hint t) ;; to test
    (lsp-bridge-enable-hover-diagnostic t) ;; to test
    (lsp-bridge-enable-debug nil) ;; to test
    (acm-backend-lsp-candidate-max-length 200) ;; fuck java, to test
    (lsp-bridge-signature-show-with-frame-position "point") ;; testing to see if pop up works
    :config
    (global-lsp-bridge-mode))
#+end_src
