init.el
  :ensure (magit :host github :repo "magit/magit"))

(use-package sqlite3
  :ensure (sqlite3 :host github :repo "pekingduck/emacs-sqlite3-api"))

(use-package yaml
  :ensure (yaml :host github :repo "zkry/yaml.el" ))
(use-package cond-let
  :ensure (cond-let :host github :repo "tarsius/cond-let"))

(use-package forge
  ;;:ensure nil
  :ensure (forge :host github :repo "magit/forge")
  )

(use-package magit-commit-mark
  :ensure (magit-commit-mark :host codeberg :repo "ideasman42/emacs-magit-commit-mark"))

(use-package magit-find-file
  :ensure (magit-find-file :host github :repo "bradwright/magit-find-file.el")
  :bind ("C-c p" . magit-find-file-completing-read))

(use-package eshell
  :ensure nil
  :demand t
  :custom
  ;; em-cmpl.el
  (eshell-show-lisp-completions nil) ; t would be too laggy and verbose.
  ;; em-dirs.el
  (eshell-pushd-tohome t)
  (eshell-pushd-dextract t)
  (eshell-pushd-dunique t)
  ;; em-glob.el
  (eshell-glob-include-dot-files t)
  (eshell-glob-include-dot-dot nil) ; if t, then grep and the alike, using -r, will grep outside of specified directory !
  ;; em-ls.el
  (eshell-ls-exclude-hidden nil) ; We already are using -A and -a, but we keep that in case, note that -A overrides this, so it won't show ".." or "." 
  (eshell-ls-initial-args "-Ah")
  (eshell-ls-dired-initial-args "-ah")
  (eshell-ls-use-in-dired t)
  ;; em-script.el
  (eshell-login-script "~/.emacs.d/eshell/elogin.el")
  (eshell-login-script "~/.emacs.d/eshell/eprofile.el")
  ;; em-term.el
  (eshell-visual-subcommands (("git" "log" "diff" "show")))
  (eshell-visual-options (("git" "--help" "-h" "--paginate" "-p" )))
  ;; em-unix.el
  (eshell-rm-removes-directories t)
  ;; esh-cmd.el
  (eshell-prefer-lisp-functions t)
  ;; esh-mode.el
  (eshell-directory-name "~/.emacs.d/eshell/")
  ;; esh-module.el
  (eshell-modules-list '(eshell-alias
                         ;; eshell-banner ; done in elogin.el
                         eshell-basic
                         eshell-cmpl
                         eshell-dirs
                         ;; eshell-elecslash ; unpractical.
                         eshell-extpipe
                         eshell-glob
                         eshell-hist
                         eshell-ls
                         eshell-pred
                         eshell-prompt
                         ;; eshell-rebind ;; bad rebinds.
                         eshell-script
                         ;; eshell-smart ;; quirky and buggy.
                         eshell-term
                         ;; eshell-tramp ;; I don't use tramp.
                         ;; eshell-xtra ;; I don't use these aliases.
                         eshell-unix)))

(use-package yasnippet
  :ensure t
  :hook (c-mode . yas-minor-mode)
  :config
  (define-key yas-minor-mode-map [(tab)]        nil)
  (define-key yas-minor-mode-map (kbd "TAB")    nil)
  (define-key yas-minor-mode-map (kbd "<tab>")  nil)
  (yas-global-mode t))

(use-package eldoc
  :ensure nil
  :demand t
  :config
  (global-eldoc-mode))

(use-package lsp-bridge
  :ensure '(lsp-bridge
            :type git :host github :repo "manateelazycat/lsp-bridge"
            :files (:defaults "*.el" "*.py" "acm" "core" "langserver" "multiserver" "resources")
            :build (:not elpaca--byte-compile))
  :custom
  (lsp-bridge-c-lsp-server "clangd")
  (lsp-bridge-python-multi-lsp-server "pylsp_ruff")
  (lsp-bridge-python-lsp-server "pylsp")
  (lsp-bridge-tex-lsp-server "texlab")
  ;;(lsp-bridge-markdown-lsp-server )
  (lsp-bridge-cmake-lsp-server "cmake-language-server")
  ;;; Variables.
  (lsp-bridge-enable-inlay-hint t) ;; to test
  (lsp-bridge-enable-hover-diagnostic t) ;; to test
  (lsp-bridge-enable-debug nil) ;; to test
  (acm-backend-lsp-candidate-max-length 200) ;; fuck java, to test
  (lsp-bridge-signature-show-with-frame-position "point") ;; testing to see if pop up works
  :config
  (global-lsp-bridge-mode))
