init.org
**** Shades Of Purple
:PROPERTIES:
:EMACS: Unspecified
:REQ_EXT: None
:REQ_INT: None
:OPT_EXT: None
:OPT_INT: None
:LASTCHECKED: 8757594c5f6265b09d156cf9f8671f78863b25db
:END:
The best dark theme in emacs.
#+begin_src elisp :tangle "yes"
  (use-package shades-of-purple-theme
    :ensure (shades-of-purple-theme :host github :repo "arturovm/shades-of-purple-emacs")
    :config
    (load-theme 'shades-of-purple t t))
#+end_src
**** Girly Notebook
:PROPERTIES:
:EMACS: 26.1
:REQ_EXT: Iosevka SS05, Iosevka Aile, Victor Mono
:REQ_INT: None
:OPT_EXT: None
:OPT_INT: None
:LASTCHECKED: 29203696a4fe54ce90ccb765962b38fadbff9ea8
:END:
Not used but, it looks very good with the fonts, and it can be a great source of inspiration.
#+begin_src elisp :tangle "yes"
  (use-package girly-notebook-theme
    :ensure (girly-notebook-theme :host github :repo "melissaboiko/girly-notebook-theme")
    :config
    (load-theme 'girly-notebook t t))
#+end_src
*** Screenshots !
**** SVG
#+begin_src elisp :tangle "yes"
  (defun screenshot-svg ()
    "Save a screenshot of the current frame as an SVG image.
  Saves to a temp file and puts the filename in the kill ring."
    (interactive)
    (let* ((filename (make-temp-file "Emacs" nil ".svg"))
           (data (x-export-frames nil 'svg)))
      (with-temp-file filename
        (insert data))
      (kill-new filename)
      (message filename)))
#+end_src
**** screenshot.el !
#+begin_src elisp :tangle "yes"
  (use-package screenshot
    :ensure (screenshot :host github :repo "tecosaur/screenshot"))
#+end_src
*** Consult + Vertico + embark
https://gitlab.com/titus.pinta/consult-tex/-/blob/546e4b16a3f98fa1d4d440acb158b8fa5147a14c/consult-tex.el
#+begin_src elisp :tangle "no"
  ;; todo
  (use-package consult
    :disabled
    :ensure t)

  ;; todo
  (use-package vertico
    :disabled
    :ensure t)

  ;; todo
  (use-package embark
    :disabled
    :ensure t)
#+end_src
** Programming Languages !
*** C !
**** Clangd !
(need to check for all build options.
#+begin_src shell :tangle "no"
  git clone --depth 1 https://github.com/llvm/llvm-project.git
  mkdir ~/.cache/llvm # just any dest basically
  cd ~/.cache/llvm
  cmake ~/llvm-project/llvm/ -DLLVM_ENABLE_PROJECTS="clang;clang-tools-extra;lld" -DCMAKE_BUILD_TYPE=Release
  # if lld is already installed, add -DLLVM_USE_LINKER=lld
  cd
  cmake --build ~/.cache/llvm #SLOW
#+end_src
**** Test-c
:PROPERTIES:
:EMACS: 23.3
:REQ_EXT: None
:REQ_INT: None
:OPT_EXT: None
:OPT_INT: None
:LASTCHECKED: 761a576f62c7021ba941f178f153c51289df1553
:END:
***** Notes
From the README :
#+begin_src markdown :tangle "no"
  Call M-x `test-c` to open a temporary `*test-c*` buffer. It is
  prefilled with a skeleton C program (customized through
  `test-c-default-code`) which is then compiled and run.

  Every following call to `test-c` will compile and run the program
  and show its ouput in the minibar.

  You can customize the compilation and run commands from the source
  itself using special definitions lines (very similar to Emacs file
  local variables in concept). Those lines must be of the form:

      /*= var: value =*/

  The `compile` and `run` variable are the one used respectively for
  compiling and running the file. You can refer to other variable from
  these variables using the `$var` syntax, similar to the shell. If you
  refer to a variable which has not been defined it will be passed as is
  to the shell, who might expand them (i.e. you can use shell/env
  variables too).

  The default value of `compile` and `run` inserted with the initial
  skeleton can be customized via the `test-c-default-compile-command`
  and `test-c-default-run-command` variables.

  `$exe` and `$src` are special variabled defined by test-c that expands
  to respectively the temporary executable filename and the temporary
  source file name.

  You can save the file and keep using Test-C afterwards.
#+end_src
***** Config
#+begin_src elisp :tangle "yes"
  (use-package test-c
    :ensure (test-c :host github :repo "aaptel/test-c")
    :custom
    (test-c-default-compile-command "gcc -O3 $src -o $exe")
    (test-c-default-run-command "$exe ; echo $?")
    (test-c-default-code "
  #include <stdio.h>
  #include <stdint.h>
  #include <stddef.h>

  int main()
    {int uwu = 17;
     printf(\"%d\\n\", uwu);};"))
#+end_src
**** Gobolt !
#+begin_src elisp :tangle "yes"
  (use-package compiler-explorer
    :ensure (compiler-explorer :host github :repo "mkcms/compiler-explorer.el")
    :bind (("M-g" . compiler-explorer)
           :map compiler-explorer-mode-map
           ("M-g c" . compiler-explorer-set-compiler)
           ("M-g f" . compiler-explorer-set-compiler-args)
           ("M-g M-f" . compiler-explorer-set-execution-args)
           ("M-g i" . compiler-explorer-set-input)
           ("M-g j" . compiler-explorer-jump)
           ("M-g y" . compiler-explorer-layout)
           ("M-g M-l a" . compiler-explorer-add-library)
           ("M-g M-l r" . compiler-explorer-remove-library)
           ("M-g r" . compiler-explorer-new-session)
           ("M-g p" . compiler-explorer-previous-session)
           ("M-g s" . compiler-explorer-make-link)
           ("M-g M-s" . compiler-explorer-restore-from-link)
           ("M-g <del>" . compiler-explorer-exit)
           ("M-g M-d" . compiler-explorer-discard-session))
    :custom
    (compiler-explorer-sessions 10)
    (compiler-explorer-default-layout [(source . asm) output]))
#+end_src
