init.el

(use-package shades-of-purple-theme
  :ensure (shades-of-purple-theme :host github :repo "arturovm/shades-of-purple-emacs")
  :config
  (load-theme 'shades-of-purple t t))

(use-package girly-notebook-theme
  :ensure (girly-notebook-theme :host github :repo "melissaboiko/girly-notebook-theme")
  :config
  (load-theme 'girly-notebook t t))

(defun screenshot-svg ()
  "Save a screenshot of the current frame as an SVG image.
Saves to a temp file and puts the filename in the kill ring."
  (interactive)
  (let* ((filename (make-temp-file "Emacs" nil ".svg"))
         (data (x-export-frames nil 'svg)))
    (with-temp-file filename
      (insert data))
    (kill-new filename)
    (message filename)))

(use-package screenshot
  :ensure (screenshot :host github :repo "tecosaur/screenshot"))

(use-package test-c
  :ensure (test-c :host github :repo "aaptel/test-c")
  :custom
  (test-c-default-compile-command "gcc -O3 $src -o $exe")
  (test-c-default-run-command "$exe ; echo $?")
  (test-c-default-code "
#include <stdio.h>
#include <stdint.h>
#include <stddef.h>

int main()
  {int uwu = 17;
   printf(\"%d\\n\", uwu);};"))

(use-package compiler-explorer
  :ensure (compiler-explorer :host github :repo "mkcms/compiler-explorer.el")
  :bind (("M-g" . compiler-explorer)
         :map compiler-explorer-mode-map
         ("M-g c" . compiler-explorer-set-compiler)
         ("M-g f" . compiler-explorer-set-compiler-args)
         ("M-g M-f" . compiler-explorer-set-execution-args)
         ("M-g i" . compiler-explorer-set-input)
         ("M-g j" . compiler-explorer-jump)
         ("M-g y" . compiler-explorer-layout)
         ("M-g M-l a" . compiler-explorer-add-library)
         ("M-g M-l r" . compiler-explorer-remove-library)
         ("M-g r" . compiler-explorer-new-session)
         ("M-g p" . compiler-explorer-previous-session)
         ("M-g s" . compiler-explorer-make-link)
         ("M-g M-s" . compiler-explorer-restore-from-link)
         ("M-g <del>" . compiler-explorer-exit)
         ("M-g M-d" . compiler-explorer-discard-session))
  :custom
  (compiler-explorer-sessions 10)
  (compiler-explorer-default-layout [(source . asm) output]))
