init.org
***** Notes
We use `c-mode-common-hook` instead of `c-initialization-hook` to prevent (elisp from not being fontified.)[https://lists.gnu.org/archive/html/bug-gnu-emacs/2025-11/msg00088.html]
*** LATEX !
https://michaelneuper.com/posts/efficient-latex-editing-with-emacs/, it also talks of "calc", seems interesting.
www.emacswiki.org/emacs/WhizzyTeX
**** Auctex !
#+begin_src elisp :tangle "yes"
  ;; gotta custom it
  (use-package auctex
    :ensure (auctex :repo "https://git.savannah.gnu.org/git/auctex.git" :branch "main"
                    :pre-build (("make" "elpa"))
                    :build (:not elpaca--compile-info) ;; Make will take care of this step
                    :files ("*.el" "doc/*.info*" "etc" "images" "latex" "style")
                    :version (lambda (_) (require 'auctex) AUCTeX-version))
    :hook (LaTeX-mode-hook . LaTeX-math-mode))
#+end_src
**** LatexMK !
#+begin_src elisp :tangle "yes"
  ;; we also need to install normal latexmk I think.
  (use-package auctex-latexmk
    :ensure t
    :custom
    (auctex-latexmk-inherit-TeX-PDF-mode t))
#+end_src
**** CDlatex !
#+begin_src elisp :tangle "yes"
  (use-package cdlatex
    :ensure (cdlatex :host github :repo "cdominik/cdlatex"))
#+end_src
**** Xenops !
#+begin_src elisp :tangle "yes"
  (use-package xenops
    :ensure (xenops :host github :repo "dandavison/xenops"))
#+end_src
**** Laas !
#+begin_src elisp :tangle "yes"
  (use-package laas
    :ensure (laas :host github repo: "tecosaur/LaTeX-auto-activating-snippets"))
#+end_src
**** amsreftex !
#+begin_src elisp :tangle "yes"
  (use-package amsreftex
    :ensure (amsreftex :host github :repo "franburstall/amsreftex"))
#+end_src
**** Magic-latex-buffer !
faces to customize.
#+begin_src elisp :tangle "yes"
  (use-package magic-latex-buffer
    :ensure (magic-latex-buffer :host github :repo "zk-phi/magic-latex-buffer"))
#+end_src
**** Latex-preview-pane !
#+begin_src elisp :tangle "yes"
  (use-package latex-preview-pane
    :ensure (latex-preview-pane :host github :repo "jsinglet/latex-preview-pane")
    :custom
    (pdf-latex-command "pdflatex") ;; default but specified in case I want to use luatex or xetex
    (preview-orientation 'right) ;; can be any of : above, left, below and right.
    (latex-preview-pane-use-frame nil) ;; default but specified in case I want to go for OneOnOneEmacs
    (latex-preview-pane-multifile-mode 'auctex))
#+end_src
**** Litex !
#+begin_src elisp :tangle "yes"
  (use-package litex-mode
    :ensure (litex-mode :host github :repo "Atreyagaurav/litex-mode"))
#+end_src
**** tex-item !
#+begin_src elisp :tangle "yes"
  (use-package tex-item
    :ensure (tex-item :host github :repo "ultronozm/tex-item.el"))
#+end_src
**** tex-parens !
#+begin_src elisp :tangle "yes"
  (use-package tex-parens
    :ensure (tex-parens :host github :repo "ultronozm/tex-parens.el"))
#+end_src
**** latex-table-wizard !
need to custom faces
#+begin_src elisp :tangle "yes"
  (use-package latex-table-wizard
    :ensure (latex-table-wizard :host github :repo "enricoflor/latex-table-wizard")
    :custom
    (latex-table-wizard-allow-detached-args t))
#+end_src
**** preview-latex !
#+begin_src elisp :tangle "yes"
  (use-package px
    :ensure (px :host github :repo "aaptel/preview-latex"))
#+end_src
**** Texlab (LSP) !
Needs Cargo, if outdated do : "rustup update"
#+begin_src shell :tangle "no"
  git clone https://github.com/latex-lsp/texlab.git ~/.cache/texlab # could be another dest but this is a practical one.
  cd ~/.cache/texlab
  cargo build --release # Remove the --release for a debug build.
  # Add it to path by modifying .bashrc or .profile or smth,
  #it'd look like : export PATH=$PATH:~/.cache/texlab/target/release
#+end_src
*** OCAML !
**** Opam
:PROPERTIES:
:EMACS: 24.1
:REQ_EXT: Opam
:REQ_INT: None
:OPT_EXT: Ocaml, Coq, Merlin
:OPT_INT: Merlin-mode, Tuareg-mode, Caml-mode, Coq-mode
:LASTCHECKED: 4d589de5765728f56af7078fae328b6792de8600
:END:
Idea : Take ownership of the repo (it is orphaned), and make it a real opam repo instead of just a script for init ?
Would need to see the overlaps between say, this, and  [[Opam-Switch !]].
#+begin_src elisp :tangle "yes"
  (use-package opam
    :ensure (opam :host github :repo "emacsorphanage/opam")
    :hook ((coq-mode merlin-mode tuareg-mode caml-mode) . opam-init))
#+end_src
**** Opam-Switch
:PROPERTIES:
:EMACS: 25.1
:REQ_EXT: Opam
:REQ_INT: None
:OPT_EXT: Ocaml, Coq, Merlin
:OPT_INT: Tuareg, Merlin-mode, Coq-mode, Caml-mode
:LASTCHECKED: 1069e56a662f23ea09d4e05611bdedeb99257012
:END:
#+begin_src elisp :tangle "yes"
  (use-package opam-switch-mode
    :ensure (opam-switch-mode :host github :repo "ProofGeneral/opam-switch-mode")
    :hook ((coq-mode tuareg-mode merlin-mode  caml-mode) . opam-switch-mode))
#+end_src
**** Caml !
#+begin_src elisp :tangle "yes"
  ;; to configure
  (use-package caml
    :ensure (caml :host github :repo "ocaml/caml-mode" :main "caml.el")
    :custom
    (caml-imenu-enable t)
    (caml-electric-indent t)
    (caml-electric-close-vector t))
#+end_src
**** Tuareg !
#+begin_src elisp :tangle "yes"
  (use-package tuareg
    :ensure (tuareg :host github :repo "ocaml/tuareg")
    :custom
    (tuareg-opam-insinuate t)
    (tuareg-electric-close-vector t)
    (tuareg-electric-indent t)
    (tuareg-indent-align-with-first-arg t)
    (tuareg-match-patterns-aligned t)
    (tuareg-mode-line-other-file t))
#+end_src
**** Merlin !
Requirement : ((emacs "25.1"))
(require 'cl-lib)
(require 'crm) ;; for completing-read-multiple
;; caml-types for highlighting
;; (https://github.com/ocaml/merlin/issues/331)
(require 'caml-types nil 'noerror)
#+begin_src elisp :tangle "yes"
  (use-package merlin
    :ensure (merlin :host github :repo "ocaml/merlin" :branch "main" :depth treeless
                    :files ("emacs/merlin.el" "emacs/merlin-imenu.el" "emacs/merlin-xref.el" "emacs/merlin-cap.el"))
    :hook ((tuareg-mode caml-mode) . merlin-mode)
    :custom
    (merlin-report-errors-in-lighter t)
    (merlin-completion-with-doc t)
    (merlin-favourite-caml-mode 'tuareg-mode)
    (merlin-error-after-save '("ml" "mli" "mly")) ;; OXcaml, metaOcaml ?
    (merlin-error-in-fringe t)
    (merlin-error-on-single-line nil)
    (merlin-locate-focus-new-window nil)
    (merlin-type-after-locate t)
    (merlin-construct-with-local-values t)
    (merlin-default-flags '("-strict-sequence" "-strict-formats"))
    (merlin-cache-lifespan 15))
#+end_src
**** Merlin-Eldoc
:PROPERTIES:
:EMACS: 24.4
:REQ_EXT: ("merlin" "3.0"), Ocaml
:REQ_INT: Eldoc
:OPT_EXT: None
:OPT_INT: Caml-mode, Tuareg-mode
:LASTCHECKED: bf8edc63d85b35e4def352fa7ce4ea39f43e1fd8
:END:
#+begin_src elisp :tangle "yes"
  (use-package merlin-eldoc
    :after (:all eldoc caml-mode tuareg-mode)
    :ensure (merlin-eldoc :host github :repo "Khady/merlin-eldoc")
    :hook ((caml-mode tuareg-mode) . merlin-eldoc-setup)
    :custom
    (merlin-eldoc-delimiter " | ")
    (merlin-eldoc-truncate-marker "(...)")
    (merlin-eldoc-skip-on-merlin-error nil))
#+end_src
**** Dune
:PROPERTIES:
:EMACS: Unspecified
:REQ_EXT: Dune
:REQ_INT: None
:OPT_EXT: None
:OPT_INT: None
:LASTCHECKED: 663ba13b5e11c1dc1058b93bcc6e5005a0adb70f dune/editor-integration/emacs
:END:
#+begin_src elisp :tangle "yes"
  (use-package dune
    :ensure (dune :host github :repo "ocaml/dune"
                  :files ("editor-integration/emacs/dune.el" "editor-integration/emacs/dune-watch.el")))
#+end_src
**** Merlin-Iedit
:PROPERTIES:
:EMACS: 25.1
:REQ_EXT: ("merlin" "3")
:REQ_INT: ("iedit" "0.9)
:OPT_EXT: None
:OPT_INT: None
:LASTCHECKED: dc19baa5a9784f2b56162c1268bde0cbc2d7cad4
:END:
#+begin_src elisp :tangle "yes"
  (use-package merlin-iedit
    :ensure (merlin-iedit :host github :repo "ocaml/merlin"
                          :files ("emacs/merlin-iedit.el")))
#+end_src
**** Ocamlformat !
#+begin_src elisp :tangle "yes"
  (use-package ocamlformat
    :ensure (ocamlformat :host github :repo "ocaml-ppx/ocamlformat")
    :hook (before-save . ocamlformat-before-save)
    :custom
    (ocamlformat-enable 'enable-outside-detected-project))
#+end_src
**** Utop !
#+begin_src elisp :tangle "yes"
  (use-package utop
    :ensure (utop :host github :repo "ocaml-community/utop"))
#+end_src
***** Faces utop :
#+begin_comment
(defface utop-prompt
  '((((background dark)) (:foreground "Cyan1"))
    (((background light)) (:foreground "blue")))
  "The face used to highlight the prompt.")

(defface utop-stdout
  nil
  "The face used to highlight messages coming from stdout.")

(defface utop-stderr
  nil
  "The face used to highlight messages coming from stderr.")

(defface utop-frozen
  '((t (:bold t)))
  "The face used to highlight text that has been sent to utop.")

(defface utop-error
  '((t (:foreground "#ff4040" :bold t :underline t)))
  "The face used to highlight errors in phrases.")
#+end_comment
*** Coq !
**** Proof General !
TODO : CONFIGURE
#+begin_src elisp :tangle "yes"
  (use-package proof-general
    :ensure (proof-general :host github :repo "ProofGeneral/PG"))
#+end_src
*** Lolcode
:PROPERTIES:
:EMACS: Unspecified
:REQ_EXT: None
:REQ_INT: lci
:OPT_EXT: None
:OPT_INT: None
:LASTCHECKED: 1914f1ba87587ecf5f175eeb2144c28e9f039317
:END:
Contribute to it by letting users change the fonts ?
#+begin_src elisp :tangle "yes"
  (use-package lolcode-mode
    :ensure (lolcode-mode :host github :repo "bodil/lolcode-mode"))
#+end_src
*** Yaml !
**** Yaml-mode !
#+begin_src elisp :tangle "yes"
  (use-package yaml-mode
    :ensure (yaml-mode :host github :repo "yoshiki/yaml-mode")
    :hook ((yaml-mode markdown-mode) . yafolding-mode)
    :init
    (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))
    :custom
    (yaml-indent-offset 4))
#+end_src
**** Yaml-pro !
yaml mode is for legacy usage of yaml-pro, the ts mode is prefered.
#+begin_src elisp :tangle "yes"
  (use-package yaml-pro
    :ensure (yaml-pro :host github :repo "zkry/yaml-pro")
    ;;:hook ((yaml-mode yaml-ts-mode) . yaml-pro-ts-mode)
    :custom
    (yaml-pro-indent (if (boundp 'yaml-indent-offset)  yaml-indent-offset 4))
    (yaml-pro-max-parse-size 5000)
    (yaml-pro-format-print-width 0)
    (yaml-pro-format-features '(block-formatting
                                bm-fn-next-line
                                document-separator-own-line
                                indent
                                reduce-newlines))
    (yaml-pro-ts-yank-subtrees t)
    (yaml-pro-ts-path-element-separator ?→))
#+end_src
