init.el
  :ensure (auctex :repo "https://git.savannah.gnu.org/git/auctex.git" :branch "main"
                  :pre-build (("make" "elpa"))
                  :build (:not elpaca--compile-info) ;; Make will take care of this step
                  :files ("*.el" "doc/*.info*" "etc" "images" "latex" "style")
                  :version (lambda (_) (require 'auctex) AUCTeX-version))
  :hook (LaTeX-mode-hook . LaTeX-math-mode)
  :custom
  (TeX-parse-self t))

;; we also need to install normal latexmk I think.
(use-package auctex-latexmk
  :ensure t
  :custom
  (auctex-latexmk-inherit-TeX-PDF-mode t))

(use-package cdlatex
  :ensure (cdlatex :host github :repo "cdominik/cdlatex"))

(use-package xenops
  :ensure (xenops :host github :repo "dandavison/xenops"))

(use-package laas
  :ensure (laas :host github repo: "tecosaur/LaTeX-auto-activating-snippets"))

(use-package amsreftex
  :ensure (amsreftex :host github :repo "franburstall/amsreftex"))

(use-package magic-latex-buffer
  :ensure (magic-latex-buffer :host github :repo "zk-phi/magic-latex-buffer"))

(use-package latex-preview-pane
  :ensure (latex-preview-pane :host github :repo "jsinglet/latex-preview-pane")
  :custom
  (pdf-latex-command "pdflatex") ;; default but specified in case I want to use luatex or xetex
  (preview-orientation 'right) ;; can be any of : above, left, below and right.
  (latex-preview-pane-use-frame nil) ;; default but specified in case I want to go for OneOnOneEmacs
  (latex-preview-pane-multifile-mode 'auctex))

(use-package litex-mode
  :ensure (litex-mode :host github :repo "Atreyagaurav/litex-mode"))

(use-package tex-item
  :ensure (tex-item :host github :repo "ultronozm/tex-item.el"))

(use-package tex-parens
  :ensure (tex-parens :host github :repo "ultronozm/tex-parens.el"))

(use-package latex-table-wizard
  :ensure (latex-table-wizard :host github :repo "enricoflor/latex-table-wizard")
  :custom
  (latex-table-wizard-allow-detached-args t))

(use-package px
  :ensure (px :host github :repo "aaptel/preview-latex"))

(use-package opam
  :ensure (opam :host github :repo "emacsorphanage/opam")
  :hook ((coq-mode merlin-mode tuareg-mode caml-mode) . opam-init))

(use-package opam-switch-mode
  :ensure (opam-switch-mode :host github :repo "ProofGeneral/opam-switch-mode")
  :hook ((coq-mode tuareg-mode merlin-mode  caml-mode) . opam-switch-mode))

;; to configure
(use-package caml
  :ensure (caml :host github :repo "ocaml/caml-mode" :main "caml.el")
  :custom
  (caml-imenu-enable t)
  (caml-electric-indent t)
  (caml-electric-close-vector t))

(use-package tuareg
  :ensure (tuareg :host github :repo "ocaml/tuareg")
  :custom
  (tuareg-opam-insinuate t)
  (tuareg-electric-close-vector t)
  (tuareg-electric-indent t)
  (tuareg-indent-align-with-first-arg t)
  (tuareg-match-patterns-aligned t)
  (tuareg-mode-line-other-file t))

(use-package merlin
  :ensure (merlin :host github :repo "ocaml/merlin" :branch "main" :depth treeless
                  :files ("emacs/merlin.el" "emacs/merlin-imenu.el" "emacs/merlin-xref.el" "emacs/merlin-cap.el"))
  :hook ((tuareg-mode caml-mode) . merlin-mode)
  :custom
  (merlin-report-errors-in-lighter t)
  (merlin-completion-with-doc t)
  (merlin-favourite-caml-mode 'tuareg-mode)
  (merlin-error-after-save '("ml" "mli" "mly")) ;; OXcaml, metaOcaml ?
  (merlin-error-in-fringe t)
  (merlin-error-on-single-line nil)
  (merlin-locate-focus-new-window nil)
  (merlin-type-after-locate t)
  (merlin-construct-with-local-values t)
  (merlin-default-flags '("-strict-sequence" "-strict-formats"))
  (merlin-cache-lifespan 15))

(use-package merlin-eldoc
  :after (:all eldoc caml-mode tuareg-mode)
  :ensure (merlin-eldoc :host github :repo "Khady/merlin-eldoc")
  :hook ((caml-mode tuareg-mode) . merlin-eldoc-setup)
  :custom
  (merlin-eldoc-delimiter " | ")
  (merlin-eldoc-truncate-marker "(...)")
  (merlin-eldoc-skip-on-merlin-error nil))

(use-package dune
  :ensure (dune :host github :repo "ocaml/dune"
                :files ("editor-integration/emacs/dune.el" "editor-integration/emacs/dune-watch.el")))

(use-package merlin-iedit
  :ensure (merlin-iedit :host github :repo "ocaml/merlin"
                        :files ("emacs/merlin-iedit.el")))

(use-package ocamlformat
  :ensure (ocamlformat :host github :repo "ocaml-ppx/ocamlformat")
  :hook (before-save . ocamlformat-before-save)
  :custom
  (ocamlformat-enable 'enable-outside-detected-project))

(use-package utop
  :ensure (utop :host github :repo "ocaml-community/utop"))

(use-package proof-general
  :ensure (proof-general :host github :repo "ProofGeneral/PG"))

(use-package lolcode-mode
  :ensure (lolcode-mode :host github :repo "bodil/lolcode-mode"))

(use-package yaml-mode
  :ensure (yaml-mode :host github :repo "yoshiki/yaml-mode")
  :hook ((yaml-mode markdown-mode) . yafolding-mode)
  :init
  (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))
  :custom
  (yaml-indent-offset 4))

(use-package yaml-pro
  :ensure (yaml-pro :host github :repo "zkry/yaml-pro")
  ;;:hook ((yaml-mode yaml-ts-mode) . yaml-pro-ts-mode)
  :custom
  (yaml-pro-indent (if (boundp 'yaml-indent-offset)  yaml-indent-offset 4))
  (yaml-pro-max-parse-size 5000)
  (yaml-pro-format-print-width 0)
  (yaml-pro-format-features '(block-formatting
                              bm-fn-next-line
                              document-separator-own-line
                              indent
                              reduce-newlines))
  (yaml-pro-ts-yank-subtrees t)
  (yaml-pro-ts-path-element-separator ?→))
