init.org
*** other handlers !
#+begin_src elisp :tangle "yes"
  (use-package format-sql
    :ensure t)

  (use-package json-reformat
    :ensure (json-reformat :host github :repo "gongo/json-reformat")
    :custom
    (json-reformat:indent-width 2)
    (json-reformat:pretty-string? t))

  (use-package call-graph
    :ensure t
    :custom
    (call-graph-path-to-global "/usr/local/bin/global")
    (call-graph-initial-max-depth 10)
    (call-graph-ignore-invalid-reference t)
    (call-graph-display-func-args t))
#+end_src
*** Java !
**** Java-mode !
- customize C-annotation-face
**** Gradle
***** Gradle Installation
Requires jdk 17+.
#+begin_src bash :tangle "no"
  # Navigate to "https://gradle.org/install/" and install the binary.
  export DEST=...
  # {DEST} could be ~/opt/gradle for example.
  export VERSION=...
  # {VERSION} is of the fomat \d\.\d\.\d, example : 9.1.0 at time of writing.
  mkdir $(DEST)
  unzip -d $(DEST) ~/Downloads/gradle-$(VERSION)-bin.zip
  ls $(DEST)/gradle-$(VERSION)
  export PATH=$PATH:$(DEST)/gradle-$(VERSION)/bin
  gradle -v
#+end_src
***** Gradle-mode
:PROPERTIES:
:EMACS: Unspecified
:REQ_EXT: gradle
:REQ_INT: ("s" "1.8.0")
:OPT_EXT: None
:OPT_INT: None
:LASTCHECKED: e4d665d5784ecda7ddfba015f07c69be3cfc45f2
:END:
#+begin_src elisp :tangle "yes"
  (use-package gradle-mode
    :ensure (gradle-mode :host github :repo "scubacabra/emacs-gradle-mode"))
#+end_src
**** JDTLS
How to install the java lsp , note you need a jdk about java 21 as of september 2025:
#+begin_src bash :tangle "no"
  export DEST= ...
  # {DEST} could be ~/.cache/ for example.
  export JAVA_HOME=...
  # jdk, not jre, for openjdk, this is usually /usr/lib/jvm/java-{VERSION}-openjdk-{architecture : arm64, amd64,...}
  # if maven (mvnw) complains about JAVA_HOME being poorly configured / missing, this is what to fix.
  git clone https://github.com/eclipse-jdtls/eclipse.jdt.ls.git $(DEST)
  cd $(DEST)
  ./mvnw clean verify -U -DskipTests=true
  echo "export PATH=$PATH:$(DEST)/eclipse.jdt.ls/org.eclipse.jdt.ls.product/target/repository/bin/" >> .bashrc
  # you could also use, say, bash.profile, the important part is for it to be in your path.
  source .bashrc
  # Same comment as above. You could also just restart the shell.
#+end_src
**** Javadoc-lookup !
:PROPERTIES:
:EMACS: Unspecified
:REQ_EXT: Maven, Java with doc
:REQ_INT: ("cl-lib" "0.3")
:OPT_EXT: None
:OPT_INT: None
:LASTCHECKED: ...
:END:
#+begin_src elisp :tangle "yes"
  (use-package javadoc-lookup
    :ensure (javadoc-lookup :host github :repo "skeeto/javadoc-lookup")
    :config
    ;;(javadoc-add-roots "/usr/share/doc/openjdk-*/api");; maybe need more work to make sure we locate it.
    )
#+end_src
*** Ebuilds !
#+begin_src elisp :tangle "yes"
  (use-package ebuild-mode
    :ensure (ebuild-mode :repo "https://gitweb.gentoo.org/proj/ebuild-mode.git"))
#+end_src
** Org !
:PROPERTIES:
:EMACS: Unspecified
:REQ_EXT: None
:REQ_INT: Org-mode
:OPT_EXT: None
:OPT_INT: None
:LASTCHECKED: None
:END:
*** org
#+begin_src elisp :tangle "yes"
  (use-package org
    :ensure nil
    :demand t
    :config
    (org-mode-restart))
#+end_src
*** toc-org
:PROPERTIES:
:EMACS: Unspecified
:REQ_EXT: None
:REQ_INT: Org-mode
:OPT_EXT: None
:OPT_INT: None
:LASTCHECKED: 6d3ae0fc47ce79b1ea06cabe21a3c596395409cd
:END:
#+begin_src elisp :tangle "yes"
  (use-package toc-org
    :after org
    :ensure (toc-org :host github :repo "snosov1/toc-org")
    :hook (((org-mode markdown-mode) . toc-org-mode)
           (toc-org-mode . (lambda () (toc-org-insert-toc))))
    :init
    (org-mode)
    :custom
    (toc-org-max-depth 100) ;; it'll never go that deep but at least it covers all use cases.
    (toc-org-hrefify-default "gh") ;; "gh" and "org" are the only options
    (toc-org-enable-links-opening t))
#+end_src
*** org-modern !
:PROPERTIES:
:EMACS: 29.1
:REQ_EXT: None
:REQ_INT: ("Org-mode" "9.6"), ("compat" "30")
:OPT_EXT: None
:OPT_INT: None
:LASTCHECKED: None
:END:
**** Config
#+begin_src elisp :tangle "yes"
  (use-package org-modern
    :after org
    :ensure (org-modern :host github :repo "minad/org-modern")
    :hook (org-mode . org-modern-mode)
    :custom
    (org-modern-progress 40))
#+end_src
**** Customization
#+begin_src elisp :tangle "no"
  (defcustom org-modern-priority-faces nil
    "Faces for priority tags.
            This is an alist, with priority character in the car and faces in
            the cdr.  Example:

              (setq org-modern-priority-faces
                (quote ((?A :background \"red\"
                            :foreground \"yellow\"))))"
    :type '(repeat
            (cons (choice
                   (character :tag "Priority")
                   (const :tag "Default" t))
                  (sexp :tag "Face   "))))
  (defcustom org-modern-tag-faces nil
    "Faces for tags keywords.
          This is an alist, with tag the car and faces in the cdr.
          Example:

            (setq org-modern-tag-faces
              (quote ((\"emacs\" :background \"red\" :foreground \"yellow\"))))"
    :type '(repeat
            (cons (choice
                   (string :tag "Keyword")
                   (const :tag "Default" t))
                  (sexp :tag "Face   "))))
  (defcustom org-modern-todo-faces nil
    "Faces for todo keywords.
        This is an alist, with todo keywords in the car and faces in the
        cdr.  Example:

          (setq org-modern-todo-faces
            (quote ((\"TODO\" :background \"red\" :foreground \"yellow\"))))"
    :type '(repeat
            (cons (choice
                   (string :tag "Keyword")
                   (const :tag "Default" t))
                  (sexp :tag "Face   "))))

  (defcustom org-modern-hide-stars 'leading
    "Changes the displays of the stars.
      Can be leading, t, or a string/character replacement for each leading
      star.  Set to nil to disable.  This feature is automatically disabled if
      `org-indent-mode' is enabled."
    :type '(choice
            (string :tag "Replacement string for leading stars")
            (character :tag "Replacement character for leading stars")
            (const :tag "Do not hide stars" nil)
            (const :tag "Hide all stars" t)
            (const :tag "Hide leading stars" leading)))

  (defcustom org-modern-fold-stars
    '(("▶" . "▼") ("▷" . "▽") ("⯈" . "⯆") ("▹" . "▿") ("▸" . "▾"))
    "Folding indicators for headings.
    Replace headings' stars with an indicator showing whether its
    tree is folded or expanded."
    :type '(repeat (cons (string :tag "Folded")
                         (string :tag "Expanded"))))

  (defcustom org-modern-replace-stars "◉○◈◇✳"
    "Replacement strings for headline stars for each level."
    :type '(choice string (repeat string)))

  (defcustom org-modern-star 'fold
    "Style heading stars.
  Can be nil, fold or replace.  See `org-modern-fold-stars' and
  `org-modern-replace-stars' for the respective configurations."
    :type '(choice (const :tag "No styling" nil)
                   (const :tag "Folding indicators" fold)
                   (const :tag "Replace" replace)))
#+end_src
*** org-popup-posframe !
:PROPERTIES:
:EMACS: 28.1
:REQ_EXT: None
:REQ_INT: ("posframe" "1.4.2"), Org-mode
:OPT_EXT: None
:OPT_INT: None
:END:
#+begin_src elisp :tangle "yes"
  (use-package org-popup-posframe
    :after org
    :ensure (org-popup-posframe :host github :repo "A7R7/org-popup-posframe")
    :hook (org-mode . org-popup-posframe-mode))
#+end_src
