init.el

(use-package format-sql
  :ensure t)

(use-package json-reformat
  :ensure (json-reformat :host github :repo "gongo/json-reformat")
  :custom
  (json-reformat:indent-width 2)
  (json-reformat:pretty-string? t))

(use-package call-graph
  :ensure t
  :custom
  (call-graph-path-to-global "/usr/local/bin/global")
  (call-graph-initial-max-depth 10)
  (call-graph-ignore-invalid-reference t)
  (call-graph-display-func-args t))

(use-package gradle-mode
  :ensure (gradle-mode :host github :repo "scubacabra/emacs-gradle-mode"))

(use-package javadoc-lookup
  :ensure (javadoc-lookup :host github :repo "skeeto/javadoc-lookup")
  :config
  ;;(javadoc-add-roots "/usr/share/doc/openjdk-*/api");; maybe need more work to make sure we locate it.
  )

(use-package ebuild-mode
  :ensure (ebuild-mode :repo "https://gitweb.gentoo.org/proj/ebuild-mode.git"))

(use-package org
  :ensure nil
  :demand t
  :config
  (org-mode-restart))

(use-package toc-org
  :after org
  :ensure (toc-org :host github :repo "snosov1/toc-org")
  :hook (((org-mode markdown-mode) . toc-org-mode)
         (toc-org-mode . (lambda () (toc-org-insert-toc))))
  :init
  (org-mode)
  :custom
  (toc-org-max-depth 100) ;; it'll never go that deep but at least it covers all use cases.
  (toc-org-hrefify-default "gh") ;; "gh" and "org" are the only options
  (toc-org-enable-links-opening t))

(use-package org-modern
  :after org
  :ensure (org-modern :host github :repo "minad/org-modern")
  :hook (org-mode . org-modern-mode)
  :custom
  (org-modern-progress 40))

(use-package org-popup-posframe
  :after org
  :ensure (org-popup-posframe :host github :repo "A7R7/org-popup-posframe")
  :hook (org-mode . org-popup-posframe-mode))
